const privacyPolicyData = {
    title: "이용약관",
    content: `
        <div>
            <div class="content text-start p-0 mt-0">
              <div>
                <h5>1. 이용약관의 목적</h5>
                <p>이 약관은 회사가 제공하는 모든 서비스(이하 "서비스")의 이용 조건 및 절차, 회사와 회원 간의 권리, 의무 및 책임 사항, 기타 필요한 사항을 규정함을 목적으로 합니다.</p>
                <h5 class="mt-2">2. 용어의 정의</h5>
                <p>이 약관에서 사용하는 용어의 정의는 다음과 같습니다:</p>
                <ul>
                  <li>"회원"이라 함은 회사의 서비스에 접속하여 이 약관에 따라 회사와 이용계약을 체결하고 회사가 제공하는 서비스를 이용하는 고객을 말합니다.</li>
                  <li>"이용계약"이라 함은 이 약관을 포함하여 서비스 이용과 관련하여 회사와 회원 간에 체결하는 모든 계약을 말합니다.</li>
                  <li>"아이디(ID)"라 함은 회원의 식별과 서비스 이용을 위하여 회원이 정하고 회사가 승인하는 문자와 숫자의 조합을 말합니다.</li>
                  <li>"비밀번호"라 함은 회원이 부여 받은 아이디와 일치된 회원임을 확인하고 회원의 비밀보호를 위해 회원 자신이 정한 문자 또는 숫자의 조합을 말합니다.</li>
                </ul>
                <h5>3. 약관의 효력 및 변경</h5>
                <p>이 약관은 회원이 서비스에 가입함과 동시에 효력이 발생합니다. 회사는 합리적인 사유가 발생할 경우 관련 법령을 위배하지 않는 범위에서 이 약관을 변경할 수 있으며, 약관이 변경되는 경우에는 변경된 약관의 적용일자 및 변경사유를 명시하여 현행 약관과 함께 회사의 초기 화면에 그 적용일자 7일 이전부터 적용일자 전일까지 공지합니다.</p>
                <h5 class="mt-2">4. 서비스의 제공 및 변경</h5>
                <p>회사는 회원에게 아래와 같은 서비스를 제공합니다:</p>
                <ul>
                  <li>콘텐츠 제공</li>
                  <li>다양한 정보 제공</li>
                  <li>기타 회사가 추가 개발하거나 다른 회사와의 제휴 계약 등을 통해 회원에게 제공하는 일체의 서비스</li>
                </ul>
                <p>회사는 서비스의 내용을 변경할 경우에는 변경 사유 및 내용을 회원에게 통지하여야 합니다.</p>
                <h5 class="mt-2">5. 서비스의 중단</h5>
                <p>회사는 컴퓨터 등 정보통신설비의 보수점검, 교체 및 고장, 통신의 두절 등의 사유가 발생한 경우에는 서비스의 제공을 일시적으로 중단할 수 있습니다. 이 경우 회사는 회원에게 사전 또는 사후에 이를 통지하여야 합니다.</p>
                <h5 class="mt-2">6. 서비스의 경매 데이터 보관</h5>
                <p>관련 법령에 따라 경매관련 기록은 3년이상 보관 됩니다</p>
                <h5 class="mt-2">7. 회원 가입</h5>
                <p>회원 가입은 이용자가 약관의 내용에 대하여 동의를 한 다음 회원가입 신청을 하고 회사가 이러한 신청에 대하여 승낙함으로써 체결됩니다. 회사는 다음 각 호에 해당하지 않는 한 회원으로 등록합니다:</p>
                <ul>
                  <li>가입 신청자가 이 약관에 의하여 이전에 회원 자격을 상실한 적이 있는 경우</li>
                  <li>등록 내용에 허위, 기재누락, 오기가 있는 경우</li>
                  <li>기타 회원으로 등록하는 것이 회사의 기술상 현저히 지장이 있다고 판단되는 경우</li>
                </ul>
                <h5>8. 회원 탈퇴 및 자격 상실</h5>
                <p>회원은 회사에 언제든지 탈퇴를 요청할 수 있으며, 회사는 즉시 회원 탈퇴를 처리합니다. 회원이 다음 각 호의 사유에 해당하는 경우, 회사는 회원 자격을 제한 및 정지시킬 수 있습니다:</p>
                <ul>
                  <li>가입 신청 시에 허위 내용을 등록한 경우</li>
                  <li>다른 사람의 서비스 이용을 방해하거나 그 정보를 도용하는 등 전자거래 질서를 위협하는 경우</li>
                  <li>서비스를 이용하여 법령 또는 이 약관이 금지하거나 공서양속에 반하는 행위를 하는 경우</li>
                </ul>
                <h5>9. 회원의 ID 및 비밀번호에 대한 의무</h5>
                <p>회원은 아이디와 비밀번호에 관해 관리책임이 있으며, 이를 제3자가 이용하도록 해서는 안 됩니다. 회원은 자신의 아이디 및 비밀번호가 도용되거나 제3자가 사용하고 있음을 인지한 경우에는 바로 회사에 통보하고 회사의 안내에 따라야 합니다.</p>
                <h5 class="mt-2">10. 회원의 의무</h5>
                <p>회원은 다음 행위를 하여서는 안 됩니다:</p>
                <ul>
                  <li>신청 또는 변경 시 허위 내용의 등록</li>
                  <li>타인의 정보 도용</li>
                  <li>회사가 게시한 정보의 변경</li>
                  <li>회사가 정한 정보 이외의 정보(컴퓨터 프로그램 등) 등의 송신 또는 게시</li>
                  <li>회사가 제공 또는 승인하지 않은 소프트웨어, 시스템 등을 이용하여 서비스를 이용하는 행위</li>
                </ul>
                <h5>11. 회사의 의무</h5>
                <p>회사는 법령과 이 약관이 금지하거나 공서양속에 반하는 행위를 하지 않으며, 지속적이고 안정적으로 서비스를 제공하기 위하여 최선을 다합니다.</p>
                <h5 class="mt-2">12. 이용약관의 변경</h5>
                <p>회사는 이 약관을 변경할 수 있으며, 변경된 약관은 적용일자 및 변경사유를 명시하여 현행 약관과 함께 초기 화면에 그 적용일자 7일 이전부터 적용일자 전일까지 공지합니다.</p>
                <h5 class="mt-2">13. 기타</h5>
                <p>본 약관에서 정하지 아니한 사항과 본 약관의 해석에 관하여는 관련 법령 및 상관례에 따릅니다.</p>
              </div>
            </div>
          </div>
    `
};

export default privacyPolicyData;