<?php

return [
    'r000' => [
        '000' => '정상조회 완료',
        '100' => '필수항목 입력 누락',
        '101' => '제휴사코드 없음',
        '102' => '차량번호 없음',
        '103' => '말소차량 조회불가',
        '104' => '유효차량만 조회가능',
        '200' => '차량번호 형식오류',
        '400' => '접근IP 미등록',
        '999' => '조회오류',
    ],
    'r101' => [
        'V001' => '기아',
        'V013' => 'BMW',
        'V036' => '현대',
    ],
    'r102' => [
        '1' => '승용',
        '2' => '승합',
        '3' => '화물',
        '4' => '특수',
    ],
    'r103' => [
        '1' => '관용',
        '2' => '자가용',
        '3' => '영업용',
        '4' => '개인택시',
    ],
    'r104' => [
        '1995' => '1995cc',
    ],
    'r106' => [
        '가솔린' => '가솔린',
        '디젤' => '디젤',
        '전기' => '전기',
        'LPG' => 'LPG',
        '하이브리드' => '하이브리드',
    ],
    'r109' => [
        '1' => '흰색',
        '2' => '검정색',
        '3' => '회색',
    ],
    'r113-01' => [
        '0' => '미장착',
        '1' => '장착',
        '2' => '선택옵션',
        '3' => '장착불가',
    ],
    'r202-01' => [
        '01' => '최초등록',
        '02' => '차량번호변경',
    ],
    'r205-01' => [
        '04' => '소유자변경',
    ],
    'r502-01' => [
        '1' => '내차사고',
        '2' => '타차보험처리',
        '3' => '가해사고',
    ],
    'r502-13' => [
        '38' => '침수전손',
        '48' => '침수분손',
    ],
    'r301' => [
        'Y' => '관용 이력 있음',
        'N' => '관용 이력 없음',
    ],
    'r302' => [
        'Y' => '영업용(일반) 이력 있음',
        'N' => '없음',
    ],
    'r303' => [
        'Y' => '영업용(대여) 이력 있음',
        'N' => '없음',
    ],
    'r601' => [
        '1' => '주행거리 정보 있음',
        '0' => '주행거리 정보 없음',
    ],
];