const privacyPolicyData = {
    title: "개인정보처리방침",
    content: `
       <div>
        <div class="content text-start p-0 mt-0">
            <div>
            <h5>1. 개인정보의 수집 및 이용 목적</h5>
            <p>회사는 다음의 목적을 위해 개인정보를 수집 및 이용합니다:</p>
            <ul>
                <li>서비스 제공에 관한 계약 이행 및 서비스 제공에 따른 요금정산</li>
                <li>회원 관리: 회원제 서비스 이용에 따른 본인 확인, 개인 식별, 불만처리 등</li>
                <li>신규 서비스 개발 및 마케팅/광고에의 활용</li>
            </ul>
            <h5>2. 수집하는 개인정보의 항목</h5>
            <p>회사는 회원가입, 상담, 서비스 신청 등을 위해 다음과 같은 개인정보를 수집할 수 있습니다:</p>
            <ul>
                <li>필수 항목: 이름, 생년월일, 성별, 로그인ID, 비밀번호, 휴대전화번호, 이메일</li>
                <li>선택 항목: 주소, 결제 정보</li>
            </ul>
            <h5>3. 개인정보의 보유 및 이용기간</h5>
            <p>회사는 개인정보 수집 및 이용목적이 달성된 후에는 해당 정보를 지체 없이 파기합니다. 단, 법령에 따라 보존할 필요가 있는 경우에는 해당 법령에서 정한 기간 동안 개인정보를 보관합니다.</p>
            <h5 class="mt-2">4. 개인정보의 파기절차 및 방법</h5>
            <p>회사는 원칙적으로 개인정보 처리 목적이 달성된 경우에는 지체 없이 해당 개인정보를 파기합니다. 파기의 절차 및 방법은 다음과 같습니다:</p>
            <ul>
                <li>파기 절차: 회원이 회원가입 등을 위해 입력한 정보는 목적이 달성된 후 별도의 DB로 옮겨져 (종이의 경우 별도의 서류함) 내부 방침 및 기타 관련 법령에 의한 정보보호 사유에 따라 (보유 및 이용기간 참조) 일정 기간 저장된 후 파기됩니다.</li>
                <li>파기 방법: 전자적 파일 형태의 정보는 기록을 재생할 수 없는 기술적 방법을 사용하여 삭제합니다. 종이에 출력된 개인정보는 분쇄기로 분쇄하거나 소각을 통해 파기합니다.</li>
            </ul>
            <h5>5. 개인정보 제공</h5>
            <p>회사는 원칙적으로 이용자의 개인정보를 외부에 제공하지 않습니다. 다만, 다음의 경우에는 예외로 합니다:</p>
            <ul>
                <li>이용자들이 사전에 동의한 경우</li>
                <li>법령의 규정에 의거하거나, 수사 목적으로 법령에 정해진 절차와 방법에 따라 수사기관의 요구가 있는 경우</li>
            </ul>
            <h5>6. 이용자 및 법정대리인의 권리와 그 행사 방법</h5>
            <p>이용자 및 법정 대리인은 언제든지 등록되어 있는 자신 혹은 당해 만 14세 미만 아동의 개인정보를 조회하거나 수정할 수 있으며, 가입해지를 요청할 수도 있습니다. 개인정보 조회/수정을 위해서는 '개인정보변경'(또는 '회원정보수정' 등)을 클릭하여 본인 확인 절차를 거치신 후 직접 열람, 정정이 가능하며, 가입해지(동의철회)를 위해서는 '회원탈퇴'를 클릭하여 본인 확인 절차를 거치신 후 직접 탈퇴가 가능합니다.</p>
            <h5 class="mt-2">7. 개인정보의 안전성 확보 조치</h5>
            <p>회사는 개인정보의 안전성 확보를 위해 다음과 같은 조치를 취하고 있습니다:</p>
            <ul>
                <li>관리적 조치: 내부관리계획 수립, 시행, 정기적 직원 교육</li>
                <li>기술적 조치: 개인정보처리시스템 등의 접근권한 관리, 접근통제 시스템 설치, 고유식별정보 등의 암호화</li>
                <li>물리적 조치: 전산실, 자료보관실 등의 접근통제</li>
            </ul>
            <h5>8. 개인정보 보호책임자 및 담당자 연락처</h5>
            <p>귀하께서는 회사의 서비스를 이용하시며 발생하는 모든 개인정보 보호 관련 민원을 개인정보 보호책임자 혹은 담당부서로 신고하실 수 있습니다. 회사는 이용자들의 신고사항에 대해 신속하게 충분한 답변을 드릴 것입니다.</p>
            <p>개인정보 보호책임자: 홍길동</p>
            <p>전화번호: 02-1234-5678</p>
            <p>이메일: privacy@example.com</p>
            <h5 class="mt-2">9. 기타</h5>
            <p>현 개인정보처리방침의 내용 추가, 삭제 및 수정이 있을 시에는 시행일 최소 7일 전부터 홈페이지의 '공지사항'을 통해 고지할 것입니다.</p>
            <p>본 방침은 2024년 6월 5일부터 시행됩니다.</p>
            </div>
        </div>
        </div>
    `
};

export default privacyPolicyData;