<template>
  <transition name="fade" mode="out-in">
    <section v-if="content === 'privacy'" @click.self="closeModal">
          <div>
            <div class="content text-start p-0 mt-0">
              <div>
                <h5>1. 개인정보의 수집 및 이용 목적</h5>
                <p>회사는 다음의 목적을 위해 개인정보를 수집 및 이용합니다:</p>
                <ul>
                  <li>서비스 제공에 관한 계약 이행 및 서비스 제공에 따른 요금정산</li>
                  <li>회원 관리: 회원제 서비스 이용에 따른 본인 확인, 개인 식별, 불만처리 등</li>
                  <li>신규 서비스 개발 및 마케팅/광고에의 활용</li>
                </ul>
                <h5>2. 수집하는 개인정보의 항목</h5>
                <p>회사는 회원가입, 상담, 서비스 신청 등을 위해 다음과 같은 개인정보를 수집할 수 있습니다:</p>
                <ul>
                  <li>필수 항목: 이름, 생년월일, 성별, 로그인ID, 비밀번호, 휴대전화번호, 이메일</li>
                  <li>선택 항목: 주소, 결제 정보</li>
                </ul>
                <h5>3. 개인정보의 보유 및 이용기간</h5>
                <p>회사는 개인정보 수집 및 이용목적이 달성된 후에는 해당 정보를 지체 없이 파기합니다. 단, 법령에 따라 보존할 필요가 있는 경우에는 해당 법령에서 정한 기간 동안 개인정보를 보관합니다.</p>
                <h5 class="mt-2">4. 개인정보의 파기절차 및 방법</h5>
                <p>회사는 원칙적으로 개인정보 처리 목적이 달성된 경우에는 지체 없이 해당 개인정보를 파기합니다. 파기의 절차 및 방법은 다음과 같습니다:</p>
                <ul>
                  <li>파기 절차: 회원이 회원가입 등을 위해 입력한 정보는 목적이 달성된 후 별도의 DB로 옮겨져 (종이의 경우 별도의 서류함) 내부 방침 및 기타 관련 법령에 의한 정보보호 사유에 따라 (보유 및 이용기간 참조) 일정 기간 저장된 후 파기됩니다.</li>
                  <li>파기 방법: 전자적 파일 형태의 정보는 기록을 재생할 수 없는 기술적 방법을 사용하여 삭제합니다. 종이에 출력된 개인정보는 분쇄기로 분쇄하거나 소각을 통해 파기합니다.</li>
                </ul>
                <h5>5. 개인정보 제공</h5>
                <p>회사는 원칙적으로 이용자의 개인정보를 외부에 제공하지 않습니다. 다만, 다음의 경우에는 예외로 합니다:</p>
                <ul>
                  <li>이용자들이 사전에 동의한 경우</li>
                  <li>법령의 규정에 의거하거나, 수사 목적으로 법령에 정해진 절차와 방법에 따라 수사기관의 요구가 있는 경우</li>
                </ul>
                <h5>6. 이용자 및 법정대리인의 권리와 그 행사 방법</h5>
                <p>이용자 및 법정 대리인은 언제든지 등록되어 있는 자신 혹은 당해 만 14세 미만 아동의 개인정보를 조회하거나 수정할 수 있으며, 가입해지를 요청할 수도 있습니다. 개인정보 조회/수정을 위해서는 '개인정보변경'(또는 '회원정보수정' 등)을 클릭하여 본인 확인 절차를 거치신 후 직접 열람, 정정이 가능하며, 가입해지(동의철회)를 위해서는 '회원탈퇴'를 클릭하여 본인 확인 절차를 거치신 후 직접 탈퇴가 가능합니다.</p>
                <h5 class="mt-2">7. 개인정보의 안전성 확보 조치</h5>
                <p>회사는 개인정보의 안전성 확보를 위해 다음과 같은 조치를 취하고 있습니다:</p>
                <ul>
                  <li>관리적 조치: 내부관리계획 수립, 시행, 정기적 직원 교육</li>
                  <li>기술적 조치: 개인정보처리시스템 등의 접근권한 관리, 접근통제 시스템 설치, 고유식별정보 등의 암호화</li>
                  <li>물리적 조치: 전산실, 자료보관실 등의 접근통제</li>
                </ul>
                <h5>8. 개인정보 보호책임자 및 담당자 연락처</h5>
                <p>귀하께서는 회사의 서비스를 이용하시며 발생하는 모든 개인정보 보호 관련 민원을 개인정보 보호책임자 혹은 담당부서로 신고하실 수 있습니다. 회사는 이용자들의 신고사항에 대해 신속하게 충분한 답변을 드릴 것입니다.</p>
                <p>개인정보 보호책임자: 홍길동</p>
                <p>전화번호: 02-1234-5678</p>
                <p>이메일: privacy@example.com</p>
                <h5 class="mt-2">9. 기타</h5>
                <p>현 개인정보처리방침의 내용 추가, 삭제 및 수정이 있을 시에는 시행일 최소 7일 전부터 홈페이지의 '공지사항'을 통해 고지할 것입니다.</p>
                <p>본 방침은 2024년 6월 5일부터 시행됩니다.</p>
              </div>
            </div>
          </div>
    </section>
  </transition>
  <transition name="fade" mode="out-in">
    <section v-if="content === 'terms'">
          <div>
            <div class="content text-start p-0 mt-0">
              <div>
                <h5>1. 이용약관의 목적</h5>
                <p>이 약관은 회사가 제공하는 모든 서비스(이하 "서비스")의 이용 조건 및 절차, 회사와 회원 간의 권리, 의무 및 책임 사항, 기타 필요한 사항을 규정함을 목적으로 합니다.</p>
                <h5 class="mt-2">2. 용어의 정의</h5>
                <p>이 약관에서 사용하는 용어의 정의는 다음과 같습니다:</p>
                <ul>
                  <li>"회원"이라 함은 회사의 서비스에 접속하여 이 약관에 따라 회사와 이용계약을 체결하고 회사가 제공하는 서비스를 이용하는 고객을 말합니다.</li>
                  <li>"이용계약"이라 함은 이 약관을 포함하여 서비스 이용과 관련하여 회사와 회원 간에 체결하는 모든 계약을 말합니다.</li>
                  <li>"아이디(ID)"라 함은 회원의 식별과 서비스 이용을 위하여 회원이 정하고 회사가 승인하는 문자와 숫자의 조합을 말합니다.</li>
                  <li>"비밀번호"라 함은 회원이 부여 받은 아이디와 일치된 회원임을 확인하고 회원의 비밀보호를 위해 회원 자신이 정한 문자 또는 숫자의 조합을 말합니다.</li>
                </ul>
                <h5>3. 약관의 효력 및 변경</h5>
                <p>이 약관은 회원이 서비스에 가입함과 동시에 효력이 발생합니다. 회사는 합리적인 사유가 발생할 경우 관련 법령을 위배하지 않는 범위에서 이 약관을 변경할 수 있으며, 약관이 변경되는 경우에는 변경된 약관의 적용일자 및 변경사유를 명시하여 현행 약관과 함께 회사의 초기 화면에 그 적용일자 7일 이전부터 적용일자 전일까지 공지합니다.</p>
                <h5 class="mt-2">4. 서비스의 제공 및 변경</h5>
                <p>회사는 회원에게 아래와 같은 서비스를 제공합니다:</p>
                <ul>
                  <li>콘텐츠 제공</li>
                  <li>다양한 정보 제공</li>
                  <li>기타 회사가 추가 개발하거나 다른 회사와의 제휴 계약 등을 통해 회원에게 제공하는 일체의 서비스</li>
                </ul>
                <p>회사는 서비스의 내용을 변경할 경우에는 변경 사유 및 내용을 회원에게 통지하여야 합니다.</p>
                <h5 class="mt-2">5. 서비스의 중단</h5>
                <p>회사는 컴퓨터 등 정보통신설비의 보수점검, 교체 및 고장, 통신의 두절 등의 사유가 발생한 경우에는 서비스의 제공을 일시적으로 중단할 수 있습니다. 이 경우 회사는 회원에게 사전 또는 사후에 이를 통지하여야 합니다.</p>
                <h5 class="mt-2">6. 서비스의 경매 데이터 보관</h5>
                <p>관련 법령에 따라 경매관련 기록은 3년이상 보관 됩니다</p>
                <h5 class="mt-2">7. 회원 가입</h5>
                <p>회원 가입은 이용자가 약관의 내용에 대하여 동의를 한 다음 회원가입 신청을 하고 회사가 이러한 신청에 대하여 승낙함으로써 체결됩니다. 회사는 다음 각 호에 해당하지 않는 한 회원으로 등록합니다:</p>
                <ul>
                  <li>가입 신청자가 이 약관에 의하여 이전에 회원 자격을 상실한 적이 있는 경우</li>
                  <li>등록 내용에 허위, 기재누락, 오기가 있는 경우</li>
                  <li>기타 회원으로 등록하는 것이 회사의 기술상 현저히 지장이 있다고 판단되는 경우</li>
                </ul>
                <h5>8. 회원 탈퇴 및 자격 상실</h5>
                <p>회원은 회사에 언제든지 탈퇴를 요청할 수 있으며, 회사는 즉시 회원 탈퇴를 처리합니다. 회원이 다음 각 호의 사유에 해당하는 경우, 회사는 회원 자격을 제한 및 정지시킬 수 있습니다:</p>
                <ul>
                  <li>가입 신청 시에 허위 내용을 등록한 경우</li>
                  <li>다른 사람의 서비스 이용을 방해하거나 그 정보를 도용하는 등 전자거래 질서를 위협하는 경우</li>
                  <li>서비스를 이용하여 법령 또는 이 약관이 금지하거나 공서양속에 반하는 행위를 하는 경우</li>
                </ul>
                <h5>9. 회원의 ID 및 비밀번호에 대한 의무</h5>
                <p>회원은 아이디와 비밀번호에 관해 관리책임이 있으며, 이를 제3자가 이용하도록 해서는 안 됩니다. 회원은 자신의 아이디 및 비밀번호가 도용되거나 제3자가 사용하고 있음을 인지한 경우에는 바로 회사에 통보하고 회사의 안내에 따라야 합니다.</p>
                <h5 class="mt-2">10. 회원의 의무</h5>
                <p>회원은 다음 행위를 하여서는 안 됩니다:</p>
                <ul>
                  <li>신청 또는 변경 시 허위 내용의 등록</li>
                  <li>타인의 정보 도용</li>
                  <li>회사가 게시한 정보의 변경</li>
                  <li>회사가 정한 정보 이외의 정보(컴퓨터 프로그램 등) 등의 송신 또는 게시</li>
                  <li>회사가 제공 또는 승인하지 않은 소프트웨어, 시스템 등을 이용하여 서비스를 이용하는 행위</li>
                </ul>
                <h5>11. 회사의 의무</h5>
                <p>회사는 법령과 이 약관이 금지하거나 공서양속에 반하는 행위를 하지 않으며, 지속적이고 안정적으로 서비스를 제공하기 위하여 최선을 다합니다.</p>
                <h5 class="mt-2">12. 이용약관의 변경</h5>
                <p>회사는 이 약관을 변경할 수 있으며, 변경된 약관은 적용일자 및 변경사유를 명시하여 현행 약관과 함께 초기 화면에 그 적용일자 7일 이전부터 적용일자 전일까지 공지합니다.</p>
                <h5 class="mt-2">13. 기타</h5>
                <p>본 약관에서 정하지 아니한 사항과 본 약관의 해석에 관하여는 관련 법령 및 상관례에 따릅니다.</p>
              </div>
            </div>
          </div>
    </section>
  </transition>
</template>

<script setup>
import { defineProps, defineEmits } from 'vue';

const props = defineProps({
  content: String
});
const emit = defineEmits(['close']);

const closeModal = () => {
  emit('close');
};

const onModalClick = (event) => {
  event.stopPropagation();
};
</script>

<style scoped>
ol, ul {
  list-style: revert;
}
.modal-backdrop {
  position: fixed;
  top: 0;
  left: 0;
  width: 100%;
  height: 100%;
  background-color: rgba(0, 0, 0, 0.5);
  display: flex;
  justify-content: center;
  align-items: center;
}
@media screen and (min-height: 1025px) {
  .modal-dialog {
    margin: 0.75rem auto;
  }
}
.fade-enter-active, .fade-leave-active {
  transition: opacity 0.5s, transform 0.5s;
  transition-timing-function: ease;
}
.fade-enter-from, .fade-leave-to {
  opacity: 0;
  transform: translateY(20px);
}
.fade-enter-to, .fade-leave-from {
  opacity: 1;
  transform: translateY(0);
}
.content ul li{
  font-size: 14px;
}
</style>
